In [1]:
import numpy as np
import pandas as pd
from sklearn.cross_validation import KFold
from sklearn.grid_search import GridSearchCV
from sklearn.metrics import accuracy_score
from xgboost import XGBClassifier

/Users/xiedong/anaconda/lib/python3.6/site-packages/sklearn/cross_validation.py:44: DeprecationWarning: This module was deprecated in version 0.18 in favor of the model_selection module into which all the refactored classes and functions are moved. Also note that the interface of the new CV iterators are different from that of this module. This module will be removed in 0.20.
  "This module will be removed in 0.20.", DeprecationWarning)
/Users/xiedong/anaconda/lib/python3.6/site-packages/sklearn/grid_search.py:43: DeprecationWarning: This module was deprecated in version 0.18 in favor of the model_selection module into which all the refactored classes and functions are moved. This module will be removed in 0.20.
  DeprecationWarning)

In [2]:
train=pd.read_csv("train.csv")
test=pd.read_csv("test.csv")
combine=[train,test]
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [3]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [5]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [6]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [7]:
test.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

In [8]:
train[['Pclass', 'Survived']].groupby(['Pclass'], as_index=False).mean().sort_values(by='Survived', ascending=False)

   Pclass  Survived
0       1  0.629630
1       2  0.472826
2       3  0.242363

In [9]:
train[['Sex', 'Survived']].groupby(['Sex'], as_index=False).mean().sort_values(by='Survived', ascending=False)

      Sex  Survived
0  female  0.742038
1    male  0.188908

In [10]:
train[['Embarked', 'Survived']].groupby(['Embarked'], as_index=False).mean().sort_values(by='Survived', ascending=False)

  Embarked  Survived
0        C  0.553571
1        Q  0.389610
2        S  0.336957

In [11]:
print("Before", train.shape, test.shape, combine[0].shape, combine[1].shape)

train = train.drop(['Ticket', 'Cabin'], axis=1)
test = test.drop(['Ticket', 'Cabin'], axis=1)
combine = [train, test]

"After", train.shape, test.shape, combine[0].shape, combine[1].shape

Before (891, 12) (418, 11) (891, 12) (418, 11)

('After', (891, 10), (418, 9), (891, 10), (418, 9))

In [12]:
for dataset in combine:
    dataset['Title'] = dataset.Name.str.extract(' ([A-Za-z]+)\.', expand=False)

pd.crosstab(train['Title'], train['Sex'])

Sex       female  male
Title
Capt           0     1
Col            0     2
Countess       1     0
Don            0     1
Dr             1     6
Jonkheer       0     1
Lady           1     0
Major          0     2
Master         0    40
Miss         182     0
Mlle           2     0
Mme            1     0
Mr             0   517
Mrs          125     0
Ms             1     0
Rev            0     6
Sir            0     1

In [13]:
for dataset in combine:
    dataset['Title'] = dataset['Title'].replace(['Lady', 'Countess','Capt', 'Col',\
 	'Don', 'Dr', 'Major', 'Rev', 'Sir', 'Jonkheer', 'Dona'], 'Rare')

    dataset['Title'] = dataset['Title'].replace('Mlle', 'Miss')
    dataset['Title'] = dataset['Title'].replace('Ms', 'Miss')
    dataset['Title'] = dataset['Title'].replace('Mme', 'Mrs')
    
train[['Title', 'Survived']].groupby(['Title'], as_index=False).mean()

    Title  Survived
0  Master  0.575000
1    Miss  0.702703
2      Mr  0.156673
3     Mrs  0.793651
4    Rare  0.347826

In [14]:
title_mapping = {"Mr": 1, "Miss": 2, "Mrs": 3, "Master": 4, "Rare": 5}
for dataset in combine:
    dataset['Title'] = dataset['Title'].map(title_mapping).astype(int)
    dataset['Title'] = dataset['Title'].fillna(0)

train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,3
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S,3
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S,1

In [15]:
for dataset in combine:
    dataset['Sex'] = dataset['Sex'].map( {'female': 1, 'male': 0} ).astype(int)

train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Title
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,7.2500,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,71.2833,C,3
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,7.9250,S,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,53.1000,S,3
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,8.0500,S,1

In [16]:
train = train.drop(['Name', 'PassengerId'], axis=1)
test = test.drop(['Name'], axis=1)
combine = [train, test]
train.shape, test.shape

((891, 9), (418, 9))

In [17]:
guess_ages = np.zeros((2,3))
for dataset in combine:
    for i in range(0, 2):
        for j in range(0, 3):
            guess_df = dataset[(dataset['Sex'] == i) & (dataset['Pclass'] == j+1)]['Age'].dropna()

            # age_mean = guess_df.mean()
            # age_std = guess_df.std()
            # age_guess = rnd.uniform(age_mean - age_std, age_mean + age_std)

            age_guess = guess_df.median()
            # Convert random age float to nearest .5 age
            guess_ages[i,j] = int(age_guess/0.5 + 0.5 ) * 0.5
            
    for i in range(0, 2):
        for j in range(0, 3):
            dataset.loc[ (dataset.Age.isnull()) & (dataset.Sex == i) & (dataset.Pclass == j+1),\
                    'Age'] = guess_ages[i,j]

    dataset['Age'] = dataset['Age'].astype(int)

train.head()

   Survived  Pclass  Sex  Age  SibSp  Parch     Fare Embarked  Title
0         0       3    0   22      1      0   7.2500        S      1
1         1       1    1   38      1      0  71.2833        C      3
2         1       3    1   26      0      0   7.9250        S      2
3         1       1    1   35      1      0  53.1000        S      3
4         0       3    0   35      0      0   8.0500        S      1

In [18]:
for dataset in combine:
    dataset['FamilySize'] = dataset['SibSp'] + dataset['Parch'] + 1
train[['FamilySize', 'Survived']].groupby(['FamilySize'], as_index=False).mean().sort_values(by='Survived', ascending=False)

   FamilySize  Survived
3           4  0.724138
2           3  0.578431
1           2  0.552795
6           7  0.333333
0           1  0.303538
4           5  0.200000
5           6  0.136364
7           8  0.000000
8          11  0.000000

In [19]:
for dataset in combine:
    dataset['IsAlone'] = 0
    dataset.loc[dataset['FamilySize'] == 1, 'IsAlone'] = 1

train[['IsAlone', 'Survived']].groupby(['IsAlone'], as_index=False).mean()

   IsAlone  Survived
0        0  0.505650
1        1  0.303538

In [20]:
freq_port = train.Embarked.dropna().mode()[0]
for dataset in combine:
    dataset['Embarked'] = dataset['Embarked'].fillna(freq_port)
    
train[['Embarked', 'Survived']].groupby(['Embarked'], as_index=False).mean().sort_values(by='Survived', ascending=False)

  Embarked  Survived
0        C  0.553571
1        Q  0.389610
2        S  0.339009

In [21]:
for dataset in combine:
    dataset['Embarked'] = dataset['Embarked'].map( {'S': 0, 'C': 1, 'Q': 2} ).astype(int)

train.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Title,FamilySize,IsAlone
0,0,3,0,22,1,0,7.2500,0,1,2,0
1,1,1,1,38,1,0,71.2833,1,3,2,0
2,1,3,1,26,0,0,7.9250,0,2,1,1
3,1,1,1,35,1,0,53.1000,0,3,2,0
4,0,3,0,35,0,0,8.0500,0,1,1,1

In [24]:
train = train.drop(['Parch','SibSp'], axis=1)
test = test.drop(['Parch','SibSp'], axis=1)
combine = [train, test]
train.head()

   Survived  Pclass  Sex  Age     Fare  Embarked  Title  FamilySize  IsAlone
0         0       3    0   22   7.2500         0      1           2        0
1         1       1    1   38  71.2833         1      3           2        0
2         1       3    1   26   7.9250         0      2           1        1
3         1       1    1   35  53.1000         0      3           2        0
4         0       3    0   35   8.0500         0      1           1        1

In [25]:
features=['Pclass','Sex','Age','Fare','Embarked','Title','FamilySize','IsAlone']
features

['Pclass', 'Sex', 'Age', 'Fare', 'Embarked', 'Title', 'FamilySize', 'IsAlone']

In [26]:
clf =XGBClassifier(learning_rate=0.1, max_depth=2, silent=True, objective='binary:logistic')

In [34]:
param_test = {
    'n_estimators': [30,32,34,36,38,40,42,44,46,48,50],
    'max_depth':[2,3,4,5,6,7]
}
grid_search = GridSearchCV(estimator = clf, param_grid = param_test, 
scoring='accuracy', cv=5)
grid_search.fit(train[features], train["Survived"])
grid_search.grid_scores_, grid_search.best_params_, grid_search.best_score_

([mean: 0.82043, std: 0.01172, params: {'max_depth': 2, 'n_estimators': 30},
  mean: 0.82155, std: 0.00956, params: {'max_depth': 2, 'n_estimators': 32},
  mean: 0.82155, std: 0.00956, params: {'max_depth': 2, 'n_estimators': 34},
  mean: 0.82155, std: 0.00956, params: {'max_depth': 2, 'n_estimators': 36},
  mean: 0.82267, std: 0.01030, params: {'max_depth': 2, 'n_estimators': 38},
  mean: 0.82043, std: 0.00985, params: {'max_depth': 2, 'n_estimators': 40},
  mean: 0.82155, std: 0.01079, params: {'max_depth': 2, 'n_estimators': 42},
  mean: 0.82267, std: 0.01040, params: {'max_depth': 2, 'n_estimators': 44},
  mean: 0.82379, std: 0.01135, params: {'max_depth': 2, 'n_estimators': 46},
  mean: 0.82604, std: 0.01308, params: {'max_depth': 2, 'n_estimators': 48},
  mean: 0.82604, std: 0.01266, params: {'max_depth': 2, 'n_estimators': 50},
  mean: 0.82379, std: 0.00859, params: {'max_depth': 3, 'n_estimators': 30},
  mean: 0.82379, std: 0.00963, params: {'max_depth': 3, 'n_estimators': 32},
  mean: 0.82492, std: 0.01186, params: {'max_depth': 3, 'n_estimators': 34},
  mean: 0.82604, std: 0.01266, params: {'max_depth': 3, 'n_estimators': 36},
  mean: 0.82492, std: 0.01194, params: {'max_depth': 3, 'n_estimators': 38},
  mean: 0.82492, std: 0.01342, params: {'max_depth': 3, 'n_estimators': 40},
  mean: 0.82267, std: 0.01190, params: {'max_depth': 3, 'n_estimators': 42},
  mean: 0.82716, std: 0.01259, params: {'max_depth': 3, 'n_estimators': 44},
  mean: 0.82716, std: 0.01394, params: {'max_depth': 3, 'n_estimators': 46},
  mean: 0.82716, std: 0.01394, params: {'max_depth': 3, 'n_estimators': 48},
  mean: 0.82828, std: 0.01349, params: {'max_depth': 3, 'n_estimators': 50},
  mean: 0.82941, std: 0.02216, params: {'max_depth': 4, 'n_estimators': 30},
  mean: 0.82828, std: 0.02070, params: {'max_depth': 4, 'n_estimators': 32},
  mean: 0.82941, std: 0.02162, params: {'max_depth': 4, 'n_estimators': 34},
  mean: 0.82828, std: 0.01769, params: {'max_depth': 4, 'n_estimators': 36},
  mean: 0.82941, std: 0.02016, params: {'max_depth': 4, 'n_estimators': 38},
  mean: 0.83053, std: 0.02025, params: {'max_depth': 4, 'n_estimators': 40},
  mean: 0.83165, std: 0.02006, params: {'max_depth': 4, 'n_estimators': 42},
  mean: 0.83165, std: 0.02040, params: {'max_depth': 4, 'n_estimators': 44},
  mean: 0.83277, std: 0.01923, params: {'max_depth': 4, 'n_estimators': 46},
  mean: 0.83053, std: 0.01625, params: {'max_depth': 4, 'n_estimators': 48},
  mean: 0.83502, std: 0.02077, params: {'max_depth': 4, 'n_estimators': 50},
  mean: 0.83951, std: 0.02335, params: {'max_depth': 5, 'n_estimators': 30},
  mean: 0.83614, std: 0.01967, params: {'max_depth': 5, 'n_estimators': 32},
  mean: 0.83838, std: 0.02043, params: {'max_depth': 5, 'n_estimators': 34},
  mean: 0.83838, std: 0.02043, params: {'max_depth': 5, 'n_estimators': 36},
  mean: 0.83838, std: 0.02043, params: {'max_depth': 5, 'n_estimators': 38},
  mean: 0.83726, std: 0.02293, params: {'max_depth': 5, 'n_estimators': 40},
  mean: 0.83838, std: 0.02015, params: {'max_depth': 5, 'n_estimators': 42},
  mean: 0.83951, std: 0.02117, params: {'max_depth': 5, 'n_estimators': 44},
  mean: 0.83951, std: 0.01829, params: {'max_depth': 5, 'n_estimators': 46},
  mean: 0.83726, std: 0.01847, params: {'max_depth': 5, 'n_estimators': 48},
  mean: 0.83838, std: 0.01784, params: {'max_depth': 5, 'n_estimators': 50},
  mean: 0.83614, std: 0.02696, params: {'max_depth': 6, 'n_estimators': 30},
  mean: 0.83726, std: 0.02475, params: {'max_depth': 6, 'n_estimators': 32},
  mean: 0.83614, std: 0.02481, params: {'max_depth': 6, 'n_estimators': 34},
  mean: 0.83726, std: 0.02615, params: {'max_depth': 6, 'n_estimators': 36},
  mean: 0.83838, std: 0.02632, params: {'max_depth': 6, 'n_estimators': 38},
  mean: 0.83726, std: 0.02667, params: {'max_depth': 6, 'n_estimators': 40},
  mean: 0.83614, std: 0.02456, params: {'max_depth': 6, 'n_estimators': 42},
  mean: 0.83838, std: 0.02695, params: {'max_depth': 6, 'n_estimators': 44},
  mean: 0.83726, std: 0.02432, params: {'max_depth': 6, 'n_estimators': 46},
  mean: 0.83726, std: 0.02424, params: {'max_depth': 6, 'n_estimators': 48},
  mean: 0.83389, std: 0.02263, params: {'max_depth': 6, 'n_estimators': 50},
  mean: 0.83838, std: 0.03244, params: {'max_depth': 7, 'n_estimators': 30},
  mean: 0.83614, std: 0.03016, params: {'max_depth': 7, 'n_estimators': 32},
  mean: 0.83389, std: 0.02959, params: {'max_depth': 7, 'n_estimators': 34},
  mean: 0.83614, std: 0.02885, params: {'max_depth': 7, 'n_estimators': 36},
  mean: 0.83726, std: 0.02791, params: {'max_depth': 7, 'n_estimators': 38},
  mean: 0.83502, std: 0.02956, params: {'max_depth': 7, 'n_estimators': 40},
  mean: 0.83277, std: 0.03071, params: {'max_depth': 7, 'n_estimators': 42},
  mean: 0.83502, std: 0.03075, params: {'max_depth': 7, 'n_estimators': 44},
  mean: 0.83389, std: 0.03133, params: {'max_depth': 7, 'n_estimators': 46},
  mean: 0.83389, std: 0.03133, params: {'max_depth': 7, 'n_estimators': 48},
  mean: 0.83165, std: 0.02983, params: {'max_depth': 7, 'n_estimators': 50}],
 {'max_depth': 5, 'n_estimators': 30},
 0.8395061728395061)

In [42]:
finalclf=XGBClassifier(learning_rate=0.1, max_depth=5,n_estimators=30, silent=True, objective='binary:logistic')
finalclf

XGBClassifier(base_score=0.5, colsample_bylevel=1, colsample_bytree=1,
       gamma=0, learning_rate=0.1, max_delta_step=0, max_depth=5,
       min_child_weight=1, missing=None, n_estimators=30, nthread=-1,
       objective='binary:logistic', reg_alpha=0, reg_lambda=1,
       scale_pos_weight=1, seed=0, silent=True, subsample=1)

In [45]:
finalclf.fit(train[features], train["Survived"])
Y_pred = finalclf.predict(test[features])
finalclf.score(train[features], train["Survived"])
acc = round(finalclf.score(train[features], train["Survived"]) * 100, 2)
acc

88.439999999999998

In [46]:
submission = pd.DataFrame({
        "PassengerId": test["PassengerId"],
        "Survived": Y_pred
    })
submission.to_csv('submission.csv', index=False)